#include "stdafx.h"

Entity Player[4] =
{
	{ "마리오", 50, 10, 10, 5, 50 }, { "루이지", 50, 5, 15, 5, 50 }, { "피치", 40, 10, 10, 10, 40 }, { "쿠파", 60, 10, 5, 5, 60 }
};

Entity Monster[90] =
{
	{ "굼바", 15, 10, 10, 5, 15, 1 },{ "굼바", 15, 10, 10, 5, 15, 1 },{ "엉금엉금", 20, 10, 5, 10, 15, 2 }, { "굼바", 20, 10, 15, 5, 15, 2 },{ "굼바", 20, 10, 15, 5, 15, 2 },{ "엉금엉금", 25, 10, 5, 15, 25, 3 },{ "가시엉금", 25, 15, 5, 10, 25, 3 },{ "그림자굼바", 30, 20, 15, 15, 30, 4 },{ "그림자엉금", 40, 20, 10, 25, 40, 6 },
	{ "하잉바", 35, 10, 10, 15, 30, 3 },{ "하잉바", 35, 10, 10, 15, 30, 3 },{ "가시하잉바", 35, 15, 10, 15, 30, 4 },{ "가시돌이", 40, 15, 15, 10, 40, 5 },{ "김수한무", 35, 15, 20, 5, 30, 6 },{ "김수한무", 35, 15, 20, 5, 30, 6 },{ "그림자하잉바", 50, 15, 15, 15, 40, 6 },{ "그림자가시돌이", 55, 20, 15, 15, 50, 7 },{ "그림자김수한무", 50, 10, 30, 10, 45, 8 },
	{ "와르르", 60, 5, 15, 5, 60, 6 },{ "와르르", 60, 5, 15, 5, 60, 6 },{ "좀비와르르", 70, 7.5, 20, 10, 70, 7 },{ "해머브러스", 45, 10, 10, 15, 45, 5 },{ "해머브러스", 45, 10, 10, 15, 45, 8 },{ "부메랑브러스", 45, 10, 15, 10, 45, 8 },{ "파이어브러스", 45, 15, 10, 10, 45, 8 },{ "그림자와르르", 80, 12.5, 15, 10, 80, 10 },{ "그림자브러스", 80, 15, 15, 15, 80, 12 },
	{ "테트라", 40, 10, 10, 5, 40, 9 },{ "테트라", 40, 10, 10, 5, 40, 9 } ,{ "마귀", 45, 12, 5, 20, 45, 10},{ "마귀", 45, 12, 5, 20, 45,10 },{ "가봉병", 65, 10, 5, 10, 65, 10 },{ "가봉병", 70, 10, 10, 10, 70, 11 },{ "그림자테트라", 50, 10, 25, 10, 50, 13 },{ "그림자마귀", 65, 17.5, 15, 20, 65, 14 },{ "그림자가봉병",  90, 15, 10, 15, 90, 15 },
	{ "뻐끔플라워", 50, 15, 5, 0, 50, 12 },{ "뻐끔플라워", 50, 15, 5, 0, 50, 12 },{ "포이즌뻐끔플라워", 55, 10, 5, 0, 50, 13 },{ "아이스뻐끔플라워", 55, 10, 5, 0, 50, 13 },{ "제비꽃씨", 45, 5, 25, 15 , 45, 14 },{ "제비꽃씨", 50, 5, 25, 20, 45, 14 },{ "반짝제비꽃씨",  60, 7.5, 30, 20, 60, 15 },{ "그림자뻐끔플라워", 80, 20, 10, 0, 80, 16 },{ "그림자제비꽃씨", 75, 10, 35, 25, 65, 16 },
	{ "각각", 80, 20, 5, 20, 80, 16 },{ "각각", 85, 20, 5, 25, 85, 17 },{ "깍깍", 90, 25, 5, 20, 90 ,18 },{ "깍깍", 90, 25, 5, 20, 90, 18 },{ "선인", 100, 10, 5, 5, 15 },{ "선인", 100, 20, 10, 50, 100, 17 },{ "선인", 100, 20, 10, 50, 100, 17 },{ "그림자각각", 100, 20, 10, 20, 100, 18 },{ "그림자선인", 120, 25, 15, 50, 120, 20 },
	{ "헬리", 85, 10, 30, 15, 85, 18 },{ "헬리", 85, 10, 30, 15, 85, 18 },{ "콥터", 85, 10, 15, 30, 85, 18 },{ "콥터", 85, 10, 15, 30, 85, 18 },{ "맘모", 150, 30, 5, 0, 150, 21 },{ "맘모", 150, 30, 5, 0, 150, 21 },{ "메가맘모", 175, 35, 5, 0, 175, 23 },{ "그림자헬리콥터", 140, 15, 30, 30, 140, 22 },{ "그림자맘모", 200, 40, 5, 5, 200, 25 },
	{ "뼈다귀", 175, 15, 30, 30, 175, 23 },{ "뼈다귀", 175, 15, 30, 30, 175, 23 },{ "가시다귀", 160, 25, 30, 25, 160, 23 },{ "가시다귀", 160, 25, 30, 25, 160, 23 },{ "빨강술사", 150, 40, 10, 10, 150, 24 },{ "파랑술사", 150, 10, 40, 10, 150, 24 },{ "노랑술사", 150, 10, 10, 40, 150, 24 },{ "그림자뼈다귀", 175, 30, 30, 30, 160, 25 },{ "그림자술사", 220, 25, 25, 25, 220, 27 },
	{ "그림자굼바", 250, 20, 20, 20, 250, 30 },{ "그림자엉금", 270, 20, 10, 20, 270, 30 },{ "그림자하잉바", 270, 20, 20, 25, 250, 30 },{ "그림자가시돌이", 280, 27.5, 25, 25, 250, 31 },{ "그림자김수한무", 270, 27.5, 30, 25, 270, 31 },{ "그림자와르르", 350, 15, 25, 15, 350, 31 },{ "그림자브러스", 290, 25, 25, 25, 70, 32 },{ "그림자테트라", 280, 15, 30, 15, 280, 32 },{ "그림자마귀", 285, 30, 25, 35, 285, 32 },
	{ "그림자가봉병",  310, 20, 10, 20, 310, 33 },{ "그림자뻐끔플라워", 300, 40, 15, 0, 300, 33 },{ "그림자제비꽃씨", 295, 10, 50, 33, 295, 33 },{ "그림자각각", 310, 20, 15, 35, 310, 34 },{ "그림자선인", 325, 25, 15, 55, 325, 34 },{ "그림자헬리콥터", 330, 20, 35, 35, 330, 34 },{ "그림자맘모", 400, 50, 5, 5, 400, 35 },{ "그림자뼈다귀", 380, 35, 35, 35, 380, 35 },{ "그림자술사", 375, 30, 30, 30, 375, 35 }
};

Entity Boss[10];

void gameMain() {
	char input = '\0';
	while (1) {
		system("cls");
		printf("　　　　<슈퍼 페이퍼 마리오: 100개의 방>　　　　\n");
		printf("□□□□□□□□□□□□□□□□□□□□□□□□\n");
		printf("□　　　　　　　　　　　　　　　　　　　　　　□\n");
		printf("□　　　■　　　　■　　　　■　　　■■■　　□\n");
		printf("□　　■■　　　■　■　　■　■　　■　　　　□\n");
		printf("□　　　■　　　■　■　　■　■　　■■　　　□\n");
		printf("□　　　■　　　■　■　　■　■　　■　　　　□\n");
		printf("□　　■■■　　　■　　　　■　　　■　　　　□\n");
		printf("□　　　　　　　　　　　　　　　　　　　　　　□\n");
		printf("□□□□□□□□□□□□□□□□□□□□□□□□\n");
		printf("Press SPACE Key to Start!\n");
		Sleep(500);
		if (_kbhit()) input = _getch();
		if (input == 32) break;
		system("cls");
		printf("　　　　<슈퍼 페이퍼 마리오: 100개의 방>　　　　\n");
		printf("■■■■■■■■■■■■■■■■■■■■■■■■\n");
		printf("■　　　　　　　　　　　　　　　　　　　　　　■\n");
		printf("■　　　□　　　　□　　　　□　　　□□□　　■\n");
		printf("■　　□□　　　□　□　　□　□　　□　　　　■\n");
		printf("■　　　□　　　□　□　　□　□　　□□　　　■\n");
		printf("■　　　□　　　□　□　　□　□　　□　　　　■\n");
		printf("■　　□□□　　　□　　　　□　　　□　　　　■\n");
		printf("■　　　　　　　　　　　　　　　　　　　　　　■\n");
		printf("■■■■■■■■■■■■■■■■■■■■■■■■\n");
		printf("Press SPACE Key to Start!\n");
		Sleep(500);
		if (_kbhit()) input = _getch();
		if (input == 32) break;
	}
	system("cls");
	printf("　　　　<슈퍼 페이퍼 마리오: 100개의 방>　　　　\n");
	Sleep(1000);
	printf("4명의 용사들과 함께 100개의 방으로 이루어진 던전을 클리어하세요!\n");
	Sleep(1000);
	printf("ATK : 공격력을 뜻합니다. 한 번의 일반 공격당 이 수치만큼의 데미지가 들어갑니다!\n");
	Sleep(1000);
	printf("SPD : 스피드를 뜻합니다. 수치가 높으면 확률적으로 여러번 공격할 수 있어요!\n");
	Sleep(1000);
	printf("CRT : 치명타율을 뜻합니다. 수치가 높으면 치명타가 뜰 확률이 증가합니다!\n");
	Sleep(1500);
	printf("모든 플레이어와 몬스터는 고유의 스킬을 가지고 있습니다. \n");
	Sleep(1000);
	printf("마리오 : 파이어 볼을 사용합니다. 일반 공격보다 더 센 공격을 할 수 있어요!\n");
	Sleep(1000);
	printf("루이지 : 네거티브 댄스를 사용합니다. 몬스터의 공격력을 일시적으로 감소시킬 수 있어요!\n");
	Sleep(1000);
	printf("피치 : 기도를 사용합니다. 체력을 회복 할 수 있어요!\n");
	Sleep(1000);
	printf("쿠파 :표효를 사용합니다. 일시적으로 공격력이 상승합니다!\n");
	Sleep(1000);
	printf("자, 그러면 게임을 시작해봅시다! SPACE키를 눌러 계속하세요. \n");
	while (1) {
		input = '\0';
		if (_kbhit()) input = _getch();
		if (input == 32) break;
	}
	system("cls");
	startGame(Player, Monster, Boss);
}

int charaSel(Entity Player[]) {
	int sel;
	while (1) {
		system("cls");
		char sel[2] = "\0";
		for (int i = 0; i < 4; i++) {
			printf("%d) Lv.%4d %8s (%4d / %4d) - HP : %5.1lf / ATK : %5.1lf / SPD : %5d / CRT : %5.1lf%%", i + 1, Player[i].LV, Player[i].Name, Player[i].EXP, (int)(Player[i].LV * 2.5 * 5), Player[i].HP, Player[i].ATK, Player[i].SPD, Player[i].CRT);
			if (Player[i].BuffDura > 0) printf(" / Buff 남은 시간 : %d", Player[i].BuffDura);
			printf("\n");
			Sleep(250);
		}
		Sleep(1250);
		printf("플레이 하고 싶은 캐릭터를 선택해주세요.\n> ");
		scanf("%s", &sel);
		switch (sel[0]) {
		case '1':
			if (Player[0].isDead == TRUE) {
				printf("해당 캐릭터는 쓰러져 있습니다.\n");
				Sleep(1500);
				system("pause");
				system("cls");
				break;
			}
			else {
				printf("%s를 선택하셨습니다.\n", Player[0].Name);
				Sleep(1500);
				system("pause");
				system("cls");
				return 0;
			}
		case '2':
			if (Player[1].isDead == TRUE) {
				printf("해당 캐릭터는 쓰러져 있습니다.\n");
				Sleep(1500);
				system("pause");
				system("cls"); 
				break;
			}
			else {
				printf("%s를 선택하셨습니다.\n", Player[1].Name);
				Sleep(1500);
				system("pause");
				system("cls"); 
				return 1;
			}
		case '3':
			if (Player[2].isDead == TRUE) {
				printf("해당 캐릭터는 쓰러져 있습니다.\n");
				Sleep(1500);
				system("pause");
				system("cls"); 
				break;
			}
			else {
				printf("%s를 선택하셨습니다.\n", Player[2].Name);
				Sleep(1500);
				system("pause");
				system("cls"); 
				return 2;
			}
		case '4':
			if (Player[3].isDead == TRUE) {
				printf("해당 캐릭터는 쓰러져 있습니다.\n");
				Sleep(1500);
				system("pause");
				system("cls"); break;
			}
			else {
				printf("%s를 선택하셨습니다.\n", Player[3].Name);
				Sleep(1500);
				system("pause");
				system("cls");
				return 3;
			}
		default:
			printf("잘못 선택하셨습니다.\n");
			Sleep(1500);
			system("pause");
			system("cls");
		}
	}
}


void startGame(Entity Player[], Entity Monster[], Entity Boss[]) {
	int chara, whoBoss, bossPower;
	system("cls");
	for (int a = 1; a <= 100; a++) {
		chara = charaSel(Player);
		if (Player[chara].StatPoint > 0) {
			printf("던전 진입 전 스탯을 분배하시겠습니까? (Y/N)\n> ");
			char yn[2];
			scanf("%s", yn);
			if (yn[0] == 'Y' || yn[0] == 'y') Stat(Player[chara]);
			system("cls");
		}
		printf("%d층에 진입합니다.\n", a);
		Sleep(1500);
		if (a % 10 == 0) {
			whoBoss = a / 10 - 1, bossPower = 10 - whoBoss;
			BossFloor(Player, Boss, whoBoss, chara, bossPower);
			bossPower--;
		}
		else Floor(Player, Monster, (9 * (a / 10)), (9 * (a / 10)) + (a % 10), a, chara);
	}
	system("pause");
}
